app/views/public_recipes/index.html.erb

     <li>
       <p>Total number of food: <%= recipe.user.foods.length %> </p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 2]]