app/views/recipes/_recipe.html.erb


  <% recipe.user.foods.each do |recipe| %>
---
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]