app/controllers/foods_controller.rb

SELECT "foods".* FROM "foods"
---
  def index
    @foods = Food.all

INSERT INTO "foods" ("name", "measurement_unit", "price", "quantity", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "sugar"], ["measurement_unit", "grs"], ["price", "5.0"], ["quantity", 3], ["user_id", 2], ["created_at", "2022-12-14 15:27:44.298531"], ["updated_at", "2022-12-14 15:27:44.298531"]]
---
  def create
    @food = Food.new(food_params)
    @food.user_id = current_user.id

    respond_to do |format|
      if @food.save

DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 3]]
---
  def destroy
    @food.destroy

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def set_food
    @food = Food.find(params[:id])