app/controllers/public_recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."public" = $1  [["public", true]]
---
  def index
    @recipes = Recipe.where(public: true)